Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm
The ReinforcementSelectionForm class represents a dialog to select rebars
using the rebar catalogs.

Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.#ctor(System.Collections.Generic.List{Tekla.Structures.Catalogs.RebarItem})
Creates a new instance of the ReinforcementSelectionForm.
RebarList: A list with the rebars that will be added to the tree.

Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.#ctor(System.Collections.Generic.List{Tekla.Structures.Catalogs.RebarItem},System.String,System.String,System.Double)
Creates a new instance of the ReinforcementSelectionForm and will select in the tree
the rebar that contains the given parameters (if possible).
RebarList: A list with the rebars that will be added to the tree.
Size: The size of the rebar to be selected.
Grade: The grade of the rebar to be selected.
BendRadius: The bend radius of the rebar to be selected.

Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.#ctor(System.Collections.Generic.List{Tekla.Structures.Catalogs.RebarItem},System.String,System.String,System.Double,System.String)
Creates a new instance of the ReinforcementSelectionForm and will select in the tree
the rebar that contains the given parameters (if possible).
RebarList: A list with the rebars that will be added to the tree.
Size: The size of the rebar to be selected.
Grade: The grade of the rebar to be selected.
BendRadius: The bend radius of the rebar to be selected.
Usage: The usage of the rebar to be selected.

Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.OnLoad(System.EventArgs)
When the load event is raised, the tree in the dialog is filled with the rebars.
The create dialog is only localized when it is not in design mode,
meaning it is shown without localization in Visual Studio.
EventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.Culture
Gets the culture.

Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.SelectedSize
Gets the selected rebar size.

Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.SelectedGrade
Gets the selected rebar grade.

Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.SelectedBendingRadius
Gets the selected rebar bending radius.

Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.SelectedUsage
Gets the selected usage.

Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.CreateNodeIfNeeded(Tekla.Structures.Catalogs.RebarItem,System.Int32,System.String,System.String)
Creates new nodes in the tree for Grades and Usages of the rebar
Item: RebarItem that is going to be added to the tree if needed
NodeType: Node type that is going to be added
MainUsage: Main usage translated string
StirrupUsage: Stirrup usage translated string

Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.CancelClicked(System.Object,System.EventArgs)
When Cancel button is clicked dialog is closed and not rebar is returned
Sender:
EventArgs:

Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.OkClicked(System.Object,System.EventArgs)
When Ok button is clicked dialog is closed and select rebar is returned
Sender:
EventArgs:

Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.Tree_MouseDoubleClick(System.Object,System.Windows.Forms.MouseEventArgs)
Double click of a bending radius node should select that node and close the dialog with the OK result
to match the classic dialog Select Reinforcement Bar behaviour
sender: Event sender
e: Mouse event arguments

Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.ReinforcementSelectionForm.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.